{
    "data": {
        "A": [
            {
                "author": "a",
                "content": " Stress Management HSC 1171 - 12 Course Overview Course Title: Stress Management Course Modality: Online (Asynchronous) Online Instructor Information Name: Dr. Jay Brown Email: Jay.Brown@tcc.fl.edu Phone: 850 201-8352 Office Location: Zoom ID: 738 645 2616 Office Hours: Mondays 1-2 PM Course Description Course Description:  Explores the nature and scope of stress in today's society, with emphasis on the impact of stress on human health. Coping strategies for environmental, social and internally induced stressors are discussed. Credits: 3.00Prerequisites and Corequisites:  Contact Hours: 3.00 Textbooks Title: Comprehensive Stress Management ISBN: 9781260834628 Authors: Jerrold S. Greenberg Publication Date: 2021-01-01 Course Outcomes Please include the student learning outcomes for the course. 1. Define stress and recognize the effects of stress on all the dimensions of health. 2. Identify their perceived stressors and potential stressors. 3. Discuss stress effects on the psychological and physiological functioning of the human body. 4. Recognize the psychological and physiological symptoms of stress. 5. Relate stress as a causative or contributing factor to the more common infectious and chronic diseases and debilitating conditions. 6. Analyze the role of perception and choice making in the creation of stress. 7. Recognize and evaluate the individual's role in the management of their own stress. 8. Identify changes in life situations and recognize how these changes affect our stress levels. 9. Evaluate strategies for managing the stress of change. 10. Analyze methods of changing personal lifestyle behaviors. 11. Discuss beneficial and detrimental effects in various stress management styles. 12. Practice personal management skills. 13. Explore and evaluate relationship skills, including communications and conflict resolution, as potential copingstrategies. 14. Identify their personal support systems. 15. Recognize the need for assertive behavior and explain its relationship to stress levels. 16. Compare and contrast personal responses to stressful situations. 17. Discuss and relate personality characteristics associated with cardiovascular disease, depression, and cancer. 18. Analyze their personal locus of control and relate it to personality types and stress control. Tallahassee Community College 3 19. Evaluate the individual’s concept of self-esteem and its relationship to stress management. 20. Recognize the role of positive thinking in stress management. 21. Practice viewing potentially stressful situations in different perspectives. 22. Identify foods and/or eating patterns that help to prevent physiological stress or to replenish nutrients lost during periods of intense stress. 23. Identify foods and/or eating patterns that may induce physiological stress. 24. Evaluate how different components of physical fitness play a role in preventing physiological stress. 25. Evaluate how different components of physical fitness can play a role in decreasing physiological stress. 26. Recognize the role of sleep in stress management. 27. Discuss the application of coping strategies for various life situations, current and future. 28. Identify and/or experience various forms of relaxation. General Education Learning Outcomes If applicable to the course, please include the general education learning outcomes for the course. 1. Acquaint students with the nature and scope of stress in today's society and the effect on their personal wellness. 2. Provide the opportunity to explore alternative coping skills to better deal with stressful events and to improve the quality of life. 3. Satisfy 3 semester hours of elective credit.Course Expectations Exams: There will be four unit exams each with a value of 100 points. They will be completed online. You will have one (1) week in order to complete each exam. You do not have to go to the testing center to complete exams. These tests will not be cumulative in nature. Makeup exams will not be permitted unless under extreme circumstances and are at the discretion of the instructor. A review will be given prior to the exam date. Final Exam: The final exam will essentially be your fourth unit exam. All students must take the final exam by the designated time (see class schedule). The final exam also has a value of 100 points. Homework Assignments: There will be ten (10) homework assignments given throughout the semester. Assignments will include all instructions, due dates and tips on how to do a good job. These assignments must be completed on the date specified in order to receive full credit for the assignment. You will have one (1) week to complete each homework assignment. Unless stated otherwise, all writing and homework assignments must be turned into Canvas by 11:59pm of the date specified in order to receive credit. Submissions after the deadline and any requests for extensions will be ignored unless extreme emergencies arise. Assignments should be completed early in the event that technological issues arise and further assistance is needed. LearnSmart Assignments: You must first register for the course by clicking on “McGraw Hill Connect” in the “Getting Started” module. Please see the PowerPoint “Accessing Connect” for step-by-step details on how to do this. There will be 16 Learn Smart assignments due throughout the semester for a total of 320 points. Without completing any of these assignments, the highest grade that you can get in the class is a D. You will have three (3) weeks to complete most LearnSmart assignments and unlimited attempts so the only way not to get full credit is to not complete them. It is imperativethat you become familiar with LearnSmart via Connect within the first week of class. Any questions regarding usage should be directed to the McGraw- Hill technological assistance line at 1-800-331-5094. Please ensure that you understand how to complete the assignments early in the semester. No excuses will be accepted regarding lack of access or comprehension of the website, as there are several labs available for your usage and an app available for both Apple and Android users (LearnSmart is the name of the app as well). Readiness Quiz: This quiz is mandatory for you to continue in this course. It must be completed after you have reviewed the Syllabus and Schedule, my welcome, tip for success, and registered your access code via Connect in the module on Canvas. This quiz must be taken by Monday, March 27th at 11:59pm for attendance verification purposes. Course Outline Unit 1 What is Stress? Stress Psychophysiology Stress and Illness/Disease Stress and the College Student Unit 2 Stress Interventions Intrapersonal Interventions Interpersonal Interventions Perception Interventions Unit 3Spirituality and Stress Meditation Autogenic Training, Imagery, & Progressive Relaxation Other Relaxation Techniques Unit 4 Physiological Arousal Interventions Stress Strategies Diversity & Stress Occupational Stress Family Stress Course Grade Evaluation Grading: The final grade is based upon a total of 1000 points: Exams 400 points (4 at 100 points each) SmartBook (LearnSmart) Assignments320 points (16 at 20 points each) Homework Assignments 200 points (10 at 20 points) Stress Management Plan 50 points Digital Literacy 15 points Readiness Quiz 15 points Total 1000 points Grade Scale Grading Scale: 900 to 1000 = A 800 to 899 = B700 to 799 = C 600 to 699 = D < 599 = F Tips for Student Success Make academics your priority. Pay attention to due dates. Use an organizational tool. Complete assignments early. Use campus resources. Ask for help when you need it. Check email often. TCC Equity Statement Tallahassee Community College is committed to improving equity by deliberately ensuring justice and fairness within the procedures and processes of the college, as well as in its distribution of resources. Equity is the practice that begins by acknowledging that advantages and barriers exist and that personal or social circumstances, such as protected class or intersecting identities, are not obstacles to achieving one’s goals. TCC’s Equal Access/Equal Opportunity Statement Tallahassee Community College does not discriminate against any person on the basis of age, color, disability, ethnicity, gender identity, genetic information, marital status, national origin, pregnancy, race, religion, sex, sexual orientation, veteran status, or other protected class in its programs and activities. Inquiries regarding the non-discrimination policies may be directed to: Renae Tolson, Equity Officer | Room 239 AdministrationBuilding | 444 Appleyard Drive | Tallahassee, FL 32304-2895 | (850) 201-6074 | renae.tolson@tcc.fl.edu Americans with Disabilities Act Tallahassee Community College is committed to making all programs, services, and facilities accessible to and usable by persons with disabilities for students to obtain maximum benefit from the educational experience and to effectively transition to our college environment. Students with disabilities who identify themselves and provide appropriate documentation are eligible for support services. To access these services, please contact the TCC Student Accessibility Services (SAS) Office. SAS Office Location First floor of Technology & Professional Programs within the Accessibility & Resource Center (ARC), Room 141 Office Hours: Monday-Friday, 8:00 a.m.- 5:00 p.m. Phone (Voice): (850) 201-8430 Fax: (850) 201-8433 E-mail: SAS@tcc.fl.edu Florida Relay Service: 711 Video Relay Service: (850) 270-6236 or (850) 270-6231 Academic Resources (Help Outside of Class) 1. The TCC Learning Commons: www.tcc.fl.edu/learningcommons, 850-201-8193 provides one-stop convenient access to expanded learning assistance and resources. The TCC Learning Commons is an excellent place to do your online homework and to get help, including one on one conferences! You can view the TCC Learning Commons website to view their hours of operation and other services. 2. Q Less Tutoring: https://tcc.mediaspace.kaltura.com 3. Virtual Learning Common’s SmartThinking Online Tutoring: See TCC Learning Commons website and navigate to these resources available 24/7. Info alsoavailable by clicking here. 4. TCC’s Library: https://www.tcc.fl.edu/academics/academic-divisions/library/, 850- 201-8376. 5. The TCC Library: https://www.tcc.fl.edu/academics/academic-divisions/library/, 850-201-8376 provides resources and services to help you achieve academic success. Librarians are available to assist you with research assignments and citations at the second-floor reference desk, the Ghazvini Library, or by virtual or in- person appointment via the appointment scheduler on the library website. Check out books in the regular collection, course reserve textbooks, laptops, and more at the first-floor circulation desk. All library employees can assist you with basic services, including printing, computer use, and booking a study room.  6. Email a TCC librarian: https://askalibrarian.org/email.php?id=1695  7. Schedule an appointment with a TCC librarian: https://tcc- fl.libcal.com/appointments. Class Recordings At Tallahassee Community College, students may, without prior notice, audio or video record a class lecture (does not include lab or recitation sessions) in which the student is enrolled for three specified purposes as outlined in House Bill 233 Section 1004.097, Florida Statutes: (1) for the student’s own personal educational use; (2) in connection with a complaint to the college where the recording is made; or (3) as evidence in, or in preparation for, a criminal or civil proceeding. https://www.tcc.fl.edu/about/college/provost/class-recordings/ Student Expectations You can contact the instructor directly via Canvas or via TCC email. Use TCC email accounts ONLY. Check your TCC email account at least daily for important information regarding the course. Email from other providers will be deleted due to virus concerns. Include course name, section (web section) in subject line, salutation, and sign your emails with your full name. You can expect a response from the instructor within 48 hours through anyof the aforementioned methods of communication. Please do not send multiple correspondences. You will be contacted as promptly as time allows."
            },
            {
                "author": "a",
                "content": "hello world"
            },
            {
                "author": "a",
                "content": "kim"
            }
        ]
    },
    "archive": {}
}