{
    "data": {
        "PLAGIARISM": [
            {
                "author": "Di ko alam",
                "content": "Assessment & Evaluation in Higher Education, Vol. 28, No. 5, October 2003 In Other (People’s) Words: plagiarism by university students—literature and lessons CHRIS PARK, The Graduate School, Lancaster University, Lancaster, UK ABSTRACT This paper reviews the literature on plagiarism by students, much of it based on North American experience, to discover what lessons it holds for institutional policy and practice within institutions of higher education in the UK. It explores seven themes:the meaning and context of plagiarism, the nature of plagiarism by students, how dostudents perceive plagiarism, how big a problem is student plagiarism, why do studentscheat, what challenges are posed by digital plagiarism and is there a need to promoteacademic integrity? It is concluded that plagiarism is doubtless common and gettingmore so (particularly with increased access to digital sources, including the Internet),that there are multiple reasons why students plagiarise and that students often rational-ise their cheating behaviour and downplay the importance of plagiarism by themselvesand their peers. It is also concluded that there is a growing need for UK institutions todevelop cohesive frameworks for dealing with student plagiarism that are based onprevention supported by robust detection and penalty systems that are transparent andapplied consistently. Introduction Much has been written on the theme of plagiarism by students, particularly in the context of North American experience. This paper reviews that literature in order to discoverwhat lessons it holds for institutional policy and practice within institutions of highereducation in the UK. As well as being ‘the problem that won’t go away’ (Paldy, 1996), plagiarism is a problem that is growing bigger. There is mounting evidence that student cheating ingeneral, and plagiarism in particular, are becoming more common and more widespread,encouraging Alschuler and Blimling (1995) to speak of ‘epidemic cheating’. Thisevidence is multi-dimensional, coming from many countries, including the USA (White,1993), the UK (Ashworth & Bannister, 1997), Southern Africa (Weeks, 2001) and and ISSN 0260-2938 print; ISSN 1469-297X online/03/050471-18 2003 Taylor & Francis Ltd DOI: 10.1080/0260293032000120352472 C. Park Finland (Seppanen, 2002), embracing both undergraduate and postgraduate students and including public and private higher institutions of education, large and small. The emphasis in this paper is on the causes and consequences of student plagiarism. Whilst the paper also addresses some aspects of designing appropriate coping strategiesfor dealing with them, this is very much a secondary theme here. It is, therefore, not byaccident that the focus is primarily on the student perspective and experience. This is notto deny the important role played by academic staff and the relevance of particularacademic traditions, for example in setting particular types of assignment which mightbe easier to plagiarise or where the temptations to plagiarise might be stronger or inprivileging the ability to reproduce existing knowledge above originality in studentwriting, which merit detailed treatment elsewhere. The paper is in seven sections, which deal in turn with the meaning and context of plagiarism, the nature of plagiarism by students, how do students perceive plagiarism,how big a problem is student plagiarism, why do students cheat and what challenges areposed by digital plagiarism. The paper rounds off by looking at the need to promoteacademic integrity. Plagiarism: Context DeﬁnitionAccording to the Collins Dictionary of the English Language (Hanks, 1979), plagiarism is ‘the act of plagiarising’, which means ‘to appropriate (ideas, passages, etc) from (another work or author)’. Plagiarism involves literary theft, stealing (by copying) thewords or ideas of someone else and passing them off as one’s own without crediting thesource. Barnhart (1988, p. 801) traces the etymology of the word plagiarism (‘literary theft’), from the earlier English word plagiary (‘one who wrongfully takes another’s words orideas’), derived from the Latin plagarius (‘kidnapper, seducer, plunderer, literary thief’), from plagium (kidnapping) from plaga (snare, net). The term plagiarism is usually used to refer to the theft of words or ideas, beyond what would normally be regarded as general knowledge. This is the spirit of thedeﬁnition of plagiarism adopted by the Association of American Historians, whodescribe it as ‘the misuse of the writings of another author … including the limitedborrowing, without attribution, of another’s distinctive and signiﬁcant research ﬁndings,hypotheses, theories … or interpretations’ (Fialkoff, 1993). Rhetoric The rhetoric of plagiarism is nothing if not colourful. Some writers describe plagiarism in moralistic tones, for example as ‘the unoriginal sin’ (Colon, 2001), ‘sin … againstoriginality’ (Anonymous, 1997) and ‘a writer’s worst sin’ (Miller, 1993). It has also beencriticised as ‘an attack on … nothing less than a basic human right, to property, toidentity’ (Freedman, 1994) and a ‘cancer that erodes the rich legacy of scholarship’(Zangrando, 1991/2). Some writers prefer more legalistic language. The US Ofﬁce ofResearch Integrity (ORI), for example, views plagiarism as ‘the theft or misappropriationof intellectual property (Anonymous, 1995). The plagiarist has been described as a‘thought thief’ (Whiteneck, 2002) or ‘intellectual shoplifter’ (Stebelman, 1998), chargedPlagiarism Literature and Lessons 473 with having committed ‘forgery’ (Groom, 2000), ‘theft of ideas’ (Hopkin, 1993) and a ‘crime’ (Franke, 1993). Whilst many regard plagiarism as malpractice, others view it as poor practice. Thus, for example, it has been dismissed as a ‘slip in scholarship’ (Leatherman, 1999) and‘poor scholarship’ (Fialkoff, 2002), a question of ‘academic etiquette and polite behav-iour … [rather than a form of] intellectual theft’ (Ashworth & Bannister, 1997), ‘a lapserather than a crime’ (Gray, 2002). More bluntly, it has been described as ‘a disease ofinarticulateness’ (Bowers, 1994) and a form of mental illness (Howard, 2000). Origin and Emergence Plagiarism is not a new phenomenon. Copying from other writers is probably as old as writing itself, but until the advent of mass-produced writing, it remained hidden from thepublic gaze. According to Mallon (1989), the Elizabethan playwright Ben Johnson was the ﬁrst person to use the word plagiary to mean literary theft, at the beginning of the 17thcentury. Then, it was not uncommon for a writer to borrow work from other writers.What Thomas (2000) calls ‘textual misappropriations’ became much more common asmass-produced books became more widely available and there was more material tosteal from. Even Shakespeare appears to have both copied (Julius, 1998) and been copied(Thomas, 2000). Before copyright laws it was difﬁcult for writers to establish let aloneprotect authorship, but by the mid 18th century plagiarism was more clearly deﬁned bycopyright laws and plagiarists were confronted with changing public attitudes towardsliterary property and strong moral views of literary theft (Goldgar, 2001). The Westernliterary tradition connects authorship with ownership, but Bowden (1996) argues thatsuch a notion is challenged by the rise of plagiarism in the post-modern literary era.Inevitably, opportunities to plagiarise the work of others have expanded greatly since theadvent and increased accessibility of the Internet. Like many things, plagiarism is seen differently when viewed through different lenses. Now widely considered a vice, in days past it was sometimes considered a virtue,imitation being considered the highest form of ﬂattery. This same tension still holds truetoday in some non-Western cultures, and it must be taken into account when dealingappropriately with plagiarism by students from different cultural backgrounds, groundedin different notions of respect for authority and different traditions of academic writing. Beyond the Academy Students have no monopoly on plagiarism as a form of dishonest behaviour. What Straw (2002) calls ‘the P-word’ is common in many ﬁelds, including journalism (Lieberman,1995), politics (Perin, 1992) and science (Vandervoort, 1995). Suspicions, allegationsand (where available) proof of plagiarism by public ﬁgures, and the fall from grace thatoften follows, regularly make headline news. Recent high proﬁle examples includehistory writer Stephen E. Ambrose, Kennedy biographer Doris Kearns Goodwin(Fitzgerald, 2002) and David Robinson, the former Vice Chancellor of Monash Univer-sity in Australia (Baty, 2002). Many well-known authors have been accused of plagiarism, including William Shakespeare (Julius, 1998), Mark Twain (Kruse, 1990), George Orwell (Rose, 1992),Alex Haley (Taylor, 1995), Samuel Beckett (Acheson, 1978) and Edgar Allen Poe(McMullen, 1995). Song writers including Celine Dion (LeBlanc, 1997) and Michael474 C. Park Jackson (Dezzani, 1999) and ﬁlm directors such as Steven Spielberg (Kessler, 1998; Zeitchik, 1998) have faced plagiarism charges in court. Others accused of plagiarisminclude the scientists Pythagoras (Maddox, 1995) and Einstein (Broad, 1997), thephilosophers Descartes (Smith, 1998), Sartre (Gottlieb, 1994) and Wittgenstein(Goldstein, 1999; Cohen, 2001) and churchmen John Wesley (Abelove, 1996) andMartin Luther King Jr (Carson & Holloran, 1991; Luker, 1993). Against this background of plagiarism as a long-established practice evidenced in many different areas of activity, plagiarism by students sits as a special problem withinhigher education. Many causes and practices of plagiarism from ‘beyond the academy’cross over into the world of student writing, although there are additional drivers ofplagiarism by students (see ‘Why do students cheat?’ below). Plagiarism by Students The core business of the knowledge industry is handling information and ideas from different sources, so there is inevitably great scope for plagiarism within the academicworld. Here plagiarism occurs in a variety of settings, including collaboration orcooperation between students working together (Wojtas, 1999), unattributed use of otherpeople’s writings by undergraduates (Ashworth & Bannister, 1997), Master’s students(Baty, 2001) and PhD students (Morgan & Thomson, 1997), copying of graduatestudents’ work by supervisors or other members of academic staff (Smith, I., 1995;Macilwain, 1998) and taking credit in research grant applications for work done bysomeone else (Stone, 1996). Types of Cheating There is an extensive literature on the theme of plagiarism within higher education, particularly in North America and particularly by students (see for example Carmack,1983; Brown, V. J. & Howell, 2001; Landau et al ., 2002). But plagiarism per se must be viewed as part of the broader problem of cheating (Leming, 1980; Barnett & Dalton,1981; Raffetto, 1985, Haines et al ., 1986; Roberts, R. N., 1986; Deikhof et al ., 1999; McCabe, 2001). Observers have situated plagiarism in different ways, as a matter ofacademic misconduct (Stern & Havlicek, 1986), academic dishonesty (Hardy, 1981/2;Singhal & Johnson, 1983; Carmack, 1983; Reams, 1987; Hollinger & Lanza-Kaduce,1996; Caruana et al., 2000; Higbee & Thomas, 2000) or academic integrity (Nuss, 1984; Iovacchini et al ., 1989; Cole & Conklin, 1996; Cole & McCabe, 1996). To some it is simply a matter of unethical behaviour (Anderson & Obenshain, 1994; Buckley et al ., 1998). Studies of academic dishonesty amongst students have often focused on the types of behaviours and practices they are likely to engage in, including cheating on tests andassignments, falsiﬁcation of data, plagiarism, inappropriate use of resources, takingcredit for work done by others and manipulation of academic staff (Raffetto, 1985;Saunders, 1993; Ferrell & Daniel, 1995; Baldwin et al ., 1998). Sims (1993) has shown how students who cheat often persist in cheating throughout their subsequent career. Plagiarism by students is a moral maze, because it raises important ethical and moral questions about good/bad or right/wrong behaviour and about acceptable/unacceptablepractices. Who decides it is wrong, on what basis and for what reasons? Who isresponsible for deciding on behavioural norms in the context of plagiarism? (Hopkin,1993). Should universities seek to teach students about values, moral leadership andPlagiarism Literature and Lessons 475 personal ethics and, if so, why and how? (Cole & Conklin, 1996). The challenge for institutions is how best to deal with what Stahl (2002) calls ‘the no-fear generation’ andStraw (2002) refers to as ‘generation ‘why-not”, who believe that the older generationis ‘clueless’ and that copying material from the Internet is ‘fair game’. Plagiarism is also a legal mineﬁeld because, although ‘plagiarism isn’t a legal term’ (Fialkoff, 1993), legal cases involving plagiarism have ended up in court in the USA,and these have tended to focus ‘on the role of intent, procedural rights and therelationship between plagiarism and copyright’ (Saunders, 1993). Brandt (2002) stressesthat ‘copyright abuse and plagiarism are like two sides of a permission coin: on the oneside, people take without asking, and on the other side, people take without telling.’ Forms of Plagiarism by Students Students plagiarise in four main ways (Wilhoit, 1994; Brandt, 2002; Howard, 2002).1. Stealing material from another source and passing it off as their own, e.g. (a) buying a paper from a research service, essay bank or term paper mill (either pre-written or specially written), (b) copying a whole paper from a source text without proper acknowledgement,(c) submitting another student’s work, with or without that student’s knowledge (e.g. by copying a computer disk). 2. Submitting a paper written by someone else (e.g. a peer or relative) and passing it off as their own. 3. Copying sections of material from one or more source texts, supplying proper documentation (including the full reference) but leaving out quotation marks, thusgiving the impression that the material has been paraphrased rather than directlyquoted. 4. Paraphrasing material from one or more source texts without supplying appropriate documentation. Whilst the word ‘plagiarism’ is not itself ambiguous, a number of complications arise as soon as it is applied to an academic setting because ‘between imitation and theft,between borrowing and plagiarism, lies a wide, murky borderland’ (Anonymous, 1997).One is the problem of distinguishing degrees of plagiarism, because it covers a spectrumof situations, ranging, as Wilhoit (1994) puts it, ‘from sloppy documentation andproof-reading to outright, premeditated fraud. Few other terms that we commonly use inour classes have such widely differing meanings’. Given that ‘zero tolerance’ is theultimate objective, how do students learn what is acceptable practice, particularly at thelower end of the spectrum? Secondly, how much does an original text need to be alteredto avoid the charge of plagiarism? Roig (2001) points out that most students strugglewith distinguishing between paraphrasing (which ‘involves restating text from anoriginal source in the writer’s own words’) and summarising (which ‘condenses largeamounts of text into a few sentences for the purpose of conveying the main points of theoriginal’). Athird difﬁculty is that whilst most authorities agree that plagiarism covers the copying of ideas as well as words, ideas are often ﬂuid and evolve through time and itis not always easy to trace and attribute the originator of ideas. White (1993) contendsthat students need to learn that sources should support, not substitute for, their own ideas.There is also uncertainty about ‘the point at which an idea passes into general knowledgein a way that no longer requires attribution’ (Leatherman, 1999). Most writers agree that476 C. Park matters of common knowledge do not need referencing in academic writing, but what precisely is ‘common knowledge’, and who deﬁnes it? Motive and Intent Some students plagiarise on purpose, knowingly. Intentional plagiarism is intentional if it is pre-meditated, designed to deceive and thus a deliberate act of literary theft. Whilstintentionality might be difﬁcult to establish or prove, there is no doubt that someplagiarism is accidental or inadvertent. Such unintentional plagiarism occurs when astudent fails to adopt (perhaps because they do not know) proper protocols for referringto academic material, including appropriate ways of quoting, acknowledging ideas andcompiling reference lists (Mills, 1994). In cases like this there is no ultimate intent todeliberately deceive, and the literary theft is accidental (Colon, 2001). Unintentional plagiarism can be caused by what psychologists describe as cryptomne- sia or ‘hidden memory’ (Brown & Halliday, 1991; Marsh & Landau, 1995), which is ‘anintriguing type of mental illusion in which people mistakenly believe that they haveproduced a new idea when in fact they have simply unwittingly retrieved an old,previously encountered idea from memory’ (Macrae et al., 1999). For example, Acheson (1978) describes Samuel Beckett’s ‘instances of involuntary memory’ and his failure toinclude footnoted acknowledgements in some essays. Experimental studies have shownhow implicit memories of previously seen material can inadvertently lead to repetition(Penpenny & Keriazokas, 1998), how such errors might be avoided (Marsh & Landau1997) and how this unconscious recall is stronger with more credible sources (Bink et al., 1999). The literature contains mixed messages about how serious a problem unintentional plagiarism is. Bugeja (2001) points out that ‘a student who honestly did not intend toplagiarise may still be held legally liable … . But, from an ethical perspective … absenceof intent is a mitigating factor’. However, Fialkoff (1993) insists that ‘there’s no excusefor plagiarism’ and Perin (1992) argues that ‘carelessness is almost as great a sin inwriters as deceit’. How do Students Perceive Plagiarism? Results from surveys of student attitudes and perceptions are often quite contradictory; some studies (for example Sutton & Huba, 1995) ﬁnd broad agreement amongst studentsabout what kinds of behaviour constitute cheating, whilst others describe great variabilityin student perceptions about cheating in general (Barnett & Dalton, 1981) and aboutplagiarism in particular (Overbey & Guiling, 1999). As Roberts and Rabinowitz (1992)point out, student perceptions of cheating situations are contingent upon the interplay ofmultiple factors such as need, provocation, opportunity and intentionality. Nonethelesssome broad patterns are apparent in the literature. First, many students generally regard plagiarism as ‘no big deal’. Payne and Nantz (1994) found that ‘according to many students, there is a signiﬁcant difference betweencheating on exams (‘blatant’ cheating) and other forms of academic cheating (oftenviewed as less serious or ‘not really’ cheating.)’. In the overall scheme of things,students often view plagiarism as a relatively minor offence, although Ashworth et al. (1997) found a strong moral basis for UK student perceptions of cheating, focusing onvalues such as friendship, trust and good learning. Sutton and Huba (1995) explored theimpact on North American students’ perceptions of academic dishonesty of racePlagiarism Literature and Lessons 477 (African-American and white students had different perceptions) and religiosity (percep- tions depended partly on students’ level of participation in religious activities). Studentsoften do not see cheating as a major problem among their peers (Daniel et al ., 1991). For example, a study by Lim and See (2001) based in Singapore, which they describeas ‘one of the most competitive educational systems in the world’, found that students‘are morally ambivalent about academic cheating and are rather tolerant of dishonestyamong their peers. On the issue of whether cheating behaviours should be reported … amajority of students chose to take the expedient measure of ignoring the problem ratherthan to blow the whistle on their peers’. Secondly, many studies have shown that academic staff and students have very different attitudes towards cheating and plagiarism (Stern & Havlicek, 1986; Anderson&Obershain, 1994; Roth & McCabe, 1995; Higbee & Thomas, 2000). Evans & Craig (1990) uncovered general agreement between high school students and staff that cheatingis a serious problem, but major differences in views regarding scale and criteria, causesand effective approaches to prevention. Academic staff views on plagiarism appear tovary between disciplines (Roig, 2001). Although staff generally consider speciﬁcdishonest behaviours as more serious than do students, there is evidence that thedifferences decrease as students progress towards graduation (Sims, 1995). Ashworthand Bannister (1997) argue that, in the UK ‘in general, plagiarism is a far lessmeaningful concept for students than it is for academic staff, and it ranks relatively lowin the student system of values’. Social Construction Payne and Nantz (1994) explore social accounts and metaphors of cheating amongst students and they conclude that students’ academic behaviour is socially constructed andlegitimated. This helps to explain why cheating and attitudes to it vary so much withinand between different groups of students and between students and staff. Framingplagiarism as a social construct is a useful way of reconciling differences in studentviews, attitudes and practices relating to cheating between western and Oriental countries(Lim & See, 2001). It also underlines the essentially socially situated nature of writing,which allows students, ‘through interaction with more experienced peers and instructors,…[to] negotiate and de-construct their notions of plagiarism’ (Evans & Youmans, 2000). How Big a Problem is Student Plagiarism? The available statistics don’t paint a very consistent picture about the scale and nature of the plagiarism problem, the extent to which it is changing through time or varies fromcountry to country, from subject to subject or between undergraduates and graduatestudents. Comparative data are difﬁcult to ﬁnd, for two main reasons. First, studies differ in focus; some examine cheating in general, others focus speciﬁcally on plagiarism.Secondly, there are differences in sources of information; some studies (for exampleMichaels & Miethe, 1989) are based on self-reporting by students, whilst others quotedetection rates by staff (which is likely to be ‘the tip of the iceberg’, because mostplagiarism probably goes undetected). Even the self-reporting category is open toambiguity and inconsistency, and Karlins et al.(1988) stress the need to investigate what students do rather than what they say they do in the context of academic dishonesty,478 C. Park because there are often major differences between the two. Caruana et al .(2000) developed and tested a measure of academic dishonesty and found it reliable and validfor measuring actual cheating and plagiarism by students. However, there is no doubtthat more research needs to be done in this area. Incidence The reported incidence of cheating varies a great deal from study to study. At the lowest end of the spectrum, Karlins et al .(1988) found that only 3% of the students on a business course plagiarised a library research assignment. More common are reportedincidence levels of at least 50%. For example, Haines et al.(1986) found that more than half of the 380 students they interviewed self-reported cheating during the academic yearin at least one area (exams, quizzes, homework assignments). In a study by Hollingerand Lanza-Kaduce (1996) more than two-thirds self-reported some form of academiccheating during a sample semester. Some studies report incidence levels of three-quartersor more. Eighty per cent of the graduate business students interviewed by Brown (1995)had engaged in at least one form of cheating, including plagiarism. Stern and Havlicek(1986) found that 82% of the 314 undergraduate students in their survey admitted toengaging in some form of academic misconduct during their college careers. Trends and Patterns Although the number of studies is small, there is evidence of patterns of variations in the incidence of cheating by students. 1. Variations between disciplines. Meade (1992) asked 6000 students at 31 top-ranked US universities if they had cheated during their college career. Cheating was mostcommonly reported by students in business studies, ranked highest (87%), followedby engineering (74%), science (67%) and humanities (63%). 2. Variations between countries, Diekhoff et al .(1999) found similarities and differ- ences in attitudes and behaviours between American and Japanese college students.Lupton et al .(2000) found signiﬁcant differences in behaviour and beliefs about cheating between US and Polish business students; 84% of the latter reported havingcheated, compared with 55% of the former. 3. Variations between undergraduate and graduate students. Few studies have explored this, but Brown (1995) found that despite their self-perception as more ethical thanundergraduates, graduate business students had a similar frequency of unethicalbehaviour compared with undergraduates in other studies. 4. Variations through time. Longitudinal and time series data on student cheating are thin on the ground, but the evidence suggests that it is becoming more common. Forexample, McCabe and Bowers (1994) discovered a dramatic increase in self-reportedcheating among male undergraduate college students between 1963 and 1991 andDiekhoff et al .(1996) found a signiﬁcant rise in cheating by US college students between 1984 and 1994. Many observers believe that the incidence of plagiarism inthe UK is on the rise, driven by ease of access to digital sources of information(particularly the Internet) (Baty, 2000) and by the relentless pressures of massparticipation and declining contact between students and staff (Ashworth & Bannis-ter, 1997).Plagiarism Literature and Lessons 479 Why do Students Cheat? Educators need to recognise the causes of plagiarism in order to address them, as Weeks (2001) stresses. But the situation is often complex and multi-dimensional, with no simplecause–effect link. For example, Michaels and Miethe (1989) situate academic cheatingwithin social psychological theories of deviance and Lieberman (1995) argues thatplagiarism resembles kleptomania ‘in that the stolen passages may not be needed and theperson taking them has a wish to be caught’. Groom (2000) suggests that the act offorgery and fakery has inherent appeal to students. There might be large-scale processesat work, too, because as society in general become more competitive and as fraudulentbehaviour is uncovered and exposed elsewhere, often on a huge scale, such as the majorEnron ﬁnancial scandal of 2002, student sensitivity towards cheating, and the propensityto take risks, may well be changing. Asimple typology of reasons why students plagiarise, informed particularly by the work of Stevens and Stevens (1987), Davis et al.(1992), Love and Simmons (1998) and Straw (2002), captures the multiple and contingent motives of plagiarism by students. 1. Genuine lack of understanding. Some students plagiarise unintentionally, when they are not familiar with proper ways of quoting, paraphrasing, citing and referencingand/or when they are unclear about the meaning of ‘common knowledge’ and theexpression ‘in their own words’. 2. Efﬁciency gain. Students plagiarise to get a better grade and to save time. Some cheat because of what Straw (2002) calls ‘the GPA thing’, so that cheating becomes ‘theprice of an A’ (Whiteman & Gordon, 2001). Auer & Krupar (2001) identify a strongconsumer mentality amongst students, who seem to believe that ‘they should getgrades based on effort rather than on achievement’. 3. Time management. There are many calls on student’s time, including peer pressure for an active social life, commitment to college sports and performance activities,family responsibilities and pressure to complete multiple work assignments in shortamounts of time. Little wonder that Silverman (2002) concludes that ‘students’overtaxed lives leave them so vulnerable to the temptations of cheating’. 4. Personal values/attitudes. Some student see no reason why they should not plagiarise or do it because of social pressure, because it makes them feel good or because theyregard short cuts as clever and acceptable 5. Deﬁance. To some students plagiarism is a tangible way of showing dissent and expressing a lack of respect for authority. They may also regard the task set as neitherimportant nor challenging 6. Students’ attitudes towards teachers and class. Some students cheat because they have negative student attitudes towards assignments and tasks that teachers think havemeaning but they don’t (Howard, 2002). Burnett (2002) emphasises the importanceof a relationship of trust between student and teacher, because ‘the classes in which[students] are more likely to cheat … are those where students believe their professordoesn’t bother to read their papers or closely review their work’. 7. Denial or neutralisation. Some students deny to themselves that they are cheating or ﬁnd ways of legitimising it by passing the blame on to others 8. Temptation and opportunity. It is both easier and more tempting for students to plagiarise as information becomes more accessible on the Internet and web searchtools make it easier and quicker to ﬁnd and copy 9. Lack of deterrence. To some students the beneﬁts of plagiarising outweigh the risks,480 C. Park particularly if they think there is little or no chance of getting caught and there is little or no punishment if they are caught (Davis & Ludvigson, 1995) Which Students Cheat (Most)? There is no doubt that some students cheat more than others. One group of students who regularly feature on the ‘at risk’ list is international students for whom English is nottheir ﬁrst language and who, as Deckert (1993) points out, ‘in settings of highereducation are frequently viewed by Western instructors as persistent plagiarizers.’ Aswell as coping with language difﬁculties, these students often have different attitudestowards academic authority and deference, come from cultures with radically differentattitudes to academic plagiarism and arrive with less well-developed study skills(including note taking, essay writing and bibliography construction skills) (Burnett,2002). Beyond this broad group there is less consensus, partly because of the complexinterplay of variables, including students’ beliefs and values, personality, stress, socialgroups and peer pressure, classroom environment and contextual and situational factors(Barnett & Dalton, 1981; Roth & McCabe, 1995; McCabe & Trevino, 1997; Pulvers &Diekhoff, 1999; Gerdeman, 2000). Determinants Although there is ongoing debate about whether (Ferrell & Daniel, 1995) or not (Brown, 1995) students who engage in cheating behaviour share common characteristics, theevidence suggests that some factors might be particularly helpful in predicting orexplaining cheating behaviour by students. 1. Gender. Cheating tends to be more common among male than among female students (Calabrese & Cochran, 1990; Buckley et al ., 1998; Straw, 2002). 2. Age and maturity. Young (Straw, 2002) and immature (Haines et al ., 1986) students tend to cheat more often than older and more mature students. 3. Academic ability. Some studies (for example Straw, 2002) have shown that cheating is more common among students with lower GPAs than among those with highergrades, but others (for example Leming, 1980) have found no such pattern 4. Student social life. Cheating is more common amongst students who party a lot and have very active social lives (Straw, 2002), students involved in several outsideactivities (Straw, 2002) and students who are members of campus fraternities andsororities (McCabe & Bowers, 1996). 5. Peer disapproval. Peer disapproval is often only a minor inﬂuence on cheating by students (Diekhoff et al., 1996), although it may be stronger in institutions with honor codes (McCabe & Trevino, 1997). 6. Student personality factors. Students tend to cheat more often if they lack conﬁdence, feel under pressure from and seek the approval of parents and peers (Raffetto, 1985),if they have an aggressive (Type A) behaviour type (Buckley et al ., 1998), if they lack commitment to their studies (Haines et al ., 1986), if they have a neutralising (rationalising) attitude (Daniel et al ., 1994) and/or they feel alienated at college (Calabrese & Cochran, 1990). 7. Student attitude towards their classes. Cheating tends to be more common in classes where the subject matter seems to students unimportant or uninteresting or where theteacher seemed disinterested or permissive (Gerdeman, 2000).Plagiarism Literature and Lessons 481 8. Risk of being caught. A number of studies have underlined the importance, in students’ decision making about cheating, of their perception of the probability andconsequences of being caught (Leming, 1980; McCabe & Trevino, 1993, 1997;Buckley et al., 1998) and of the importance of deterrents such as embarrassment and fear of punishment (Diekhoff et al ., 1996). Digital Plagiarism Recent years have witnessed the emergence and proliferation of a new form of plagiarism, from digital sources, which offers new opportunities and ease of access andwhich poses particular challenges across the whole education sector globally. Studentsnow have ready access to a huge variety of digital sources, including full-text CD-ROMdatabases and electronic journals on the Internet (Ashworth & Bannister, 1997), most ofwhich are rapidly accessible 24 hours a day 7 days a week and can be downloaded fromthe safety and comfort of their own rooms. Material on the Internet is particularlyaccessible via effective search engines such as Google.com (Lathrop & Foss, 2000;Laird, 2001), which is why UK universities are taking steps to cope with the expectedrise in the incidence of student plagiarism (Baty, 2000). The Internet The Internet provides unparalleled temptation and almost unrestricted opportunities for students to cheat by engaging in what has variously been described as ‘cybercheating’(Stebelman, 1998), ‘cyberplagiarism’ (Anderson, 1999), ‘mouse click plagiarism’ (Auer&Krupar, 2001) and ‘academic cyber-sloth’ (Carnie, 2001). Laird (2001) has suggested that ‘Internet plagiarism may be gathering sufﬁcient force to become an academichurricane’. One of the major problems confronting universities is to persuade students that such material is not ‘free for the taking’ (Colon, 2001; Whiteneck, 2002) in the same way thatartists can freely collect and use ‘found objects’. Attitudes towards ownership of materialon the web is a major challenge, because today’s students ‘have become so accustomedto downloading music and reading articles free on the Internet that they see it asacceptable to incorporate passages into their papers without attribution as well’ (Young,2001). Kellogg (2002) warns that ‘the problem is likely to get worse as more and morestudents reared on the Internet enter college’. It’s not all bad news because, as Carnie (2001) points out, ‘the Web is a fabulous resource that no student or scholar can ignore. Somehow, though, we have to convincepeople that learning requires more than high-speed connections and a good searchengine’. Term Paper Mills Agrowing challenge for universities everywhere is the proliferation of online term paper mills (Anderson, 1999), through which ‘a student can simply log onto the Internet andbuy a paper with a click and a credit card’ (Whiteneck, 2002). Groark et al.(2001) point out that paper mills existed long before the Internet, although ‘with the advent of Internettechnology … the number of places where papers are available has grown and the easewith which papers can be obtained has increased’.482 C. Park Paper mills, such as www.cheathouse.com and www.schoolsucks.com, sell pre-pre- pared essays and papers over the Internet (Furedi, 2000), as an enterprising form ofacademic ‘outsourcing’ (Anonymous, 2002), or what Silverman (2002) describes as‘paper pilfering’. Some sites allow free downloads while others charge, including anextra fee for immediate E-mail delivery (Stebelman, 1998). Some will write a cus-tomised paper, using an online ghost-writer who will produce a custom-written paper onany particular topic, within an agreed time frame, for an agreed fee (Howard, 2002). OneNorth American web site (www.ivyessays.com) even sells successful college admissionessays to students. Digital Detection Digital plagiarism is a double-edged sword for students, because whilst it allows them to ﬁnd and copy material at will, the same technology allows staff to detect plagiarismby comparing versions of text (including comparing a student’s text with massivedatabases which cover much of the Internet). Web search engines (likewww.Google.com) allow staff to search the Internet for web sites containing strings ofwords, if they suspect that parts of a student’s assignment have been plagiarised from theInternet. In this sense ‘the Internet may make it easier to copy, but it also makes it easierto expose the copier’ (Colon, 2001). Fialkoff (2002) concludes that ’ it is clear thattechnology has made the practice of good scholarship more complex, even if theprinciples remain the same. … The computer, and the net, may be both a curse and ablessing when it comes to writing …’. Promoting Academic Integrity Surveys of student cheating in North American universities during the 1990s showed that ‘students don’t think cheating is a big deal and professors [academic staff] are doinglittle to curb it’ (Wilson, 1999). In response to this challenge, many institutions adoptedformal honor codes, designed to appeal to students’ sense of ethics and to emphasisesuch values as truth, accountability and social responsibility (Bugeja, 2001). Underlyingthis movement has been a desire to foster what McCabe and Trevino (2002) describe asa‘culture of integrity’, aimed at reducing student cheating but also at foregrounding ‘the value of living in a community of trust’. Honor Codes Uptake of the honor code idea was initially slow; by 1994 only about a quarter of the colleges and universities in North America had introduced them (Kibler, 1994). In thelate 1990s US colleges were urged to take a more proactive stance towards preventingcheating by students, and to deﬁne academic integrity and stress its importance (Wilson,1999). The establishment of the Center for Academic Integrity (CAI) at Duke Universityin North Carolina was instrumental in achieving this ambition. The Center, a consortiumof more than 200 institutions of higher education in North America, promotes anapproach that emphasises the fundamental values of academic integrity (honesty, trust,fairness, respect and responsibility) (McCabe & Pavela, 1997). The CAI approach is based on advising students what academic integrity is and why it is important (thus identifying values and behaviours to be promoted, rather than listingbehaviours to be prohibited) and encouraging or requiring students to sign a pledge thatPlagiarism Literature and Lessons 483 they will uphold academic integrity and not cheat or plagiarise. Procedures vary from place to place, within the spirit of the honor code system. At some institutions, such asDuke University (Burnett, 2002) and Vanderbilt University (McCabe & Trevino, 2002),students take part in public ‘signing ceremonies’, to indicate their personal commitmentto upholding the institutional honor code. At other institutions, such as the University ofMaryland (Anonymous, 2001), students are asked to write and sign an honor pledge oneach of their assignments and exams. No matter whether, when and how often students are asked to sign an honor pledge, it is vitally important that the institution has a clear code that is distributed or readilyavailable to all students and that academic staff hold discussions with their students toestablish academic ‘rules of engagement’ and avoid misunderstandings (Burnett, 2002).Students must be made aware that academic integrity is a major institutional priority(McCabe & Trevino, 2002). North American experience also shows that honor code systems work best when students are actively engaged in the process and take part in it, if not actually assumeownership of it. Few honor code systems are entirely student managed (Paldy, 1996),and codes that require students to report instances of academic dishonesty rarely workeffectively (Jendrek, 1992). McCabe and Trevino (2002) insist that there should be‘student participation in campus judicial or hearing bodies that review alleged infringe-ments of the honor code … [that] students should also have a voice on task forces orcommittees charged with informing other students about the purposes and philosophy ofthe code, and they should play a major role in its development and implementation’. There is ongoing debate about whether or not integrity can be taught (Vandervoort, 1995) and student attitudes towards academic integrity appear to be inﬂuenced bymultiple factors, including students’ personal characteristics, student activities, studentattitudes and gender (Iovacchini et al ., 1989). Nonetheless, there is mounting evidence that students in institutions with academic honor codes view the issue of academicintegrity and treat cheating behaviours in very different ways to those at institutionswithout honor codes (McCabe et al ., 1999). Academic honesty is higher, and levels of self-reported cheating are lower, in institutions that have honor codes (May & Lloyd,1993; McCabe & Bowers, 1994). Conclusion There is an extensive literature on plagiarism by students, particularly in the context of North America experience, but it clearly holds important lessons for institutional policyand practice within institutions of higher education in the UK. The literature shows thatplagiarism by students is common and getting more so (particularly with increasedaccess to digital sources, including the Internet), that there are multiple reasons whystudents plagiarise and that students often rationalise their cheating behaviour anddownplay the importance of plagiarism by themselves and their peers. Whether or not the problem has reached epidemic proportions, as some observers insist, it is clearly a major problem, and one that appears to be on the increase. Thepractice of plagiarism is a major challenge to institutional aspirations of academicintegrity and a major threat to institutional quality assurance and enhancement, and itneeds to be taken into account when developing and implementing institutional learning,teaching and assessment strategies. There is a growing need for UK institutions todevelop cohesive frameworks for dealing with student plagiarism that are based on484 C. Park prevention supported by robust detection and penalty systems that are transparent and applied consistently. Notes on Contributor CHRIS PARK is Director of the Graduate School at Lancaster University and is closely involved with quality assurance issues, both internally and externally (as a QAAInstitutional Auditor). He has taught and assessed in universities in the UK for over25 years and also has some experience of universities in the USA. His interest instudent plagiarism was sparked by serving as chair of a working party at Lancastercharged with developing an institutional framework for preventing, detecting andpenalising plagiarism by students. He would welcome views and feedback, via email.Correspondence: The Graduate School, Lancaster University, Lancaster LA1 4YB, UK. E-mail: c.park@lancaster.ac.uk REFERENCES ABELOVE ,H.(1996) John Wesley’s plagiarism of Samuel Johnson and its contemporary reception, Huntington Library Quarterly ,59(1), pp. 73–80. ACHESON ,J.(1978) Beckett, Proust and Schopenhauer, Contemporary Literature ,19(2), pp. 165–180. ALSCHULER ,A .S .&B LIMLING ,G.S.(1995) Curbing epidemic cheating through systemic change, College Teaching ,43(4), pp. 123–126. ANDERSON ,G.L.(1999) Cyberplagiarism, College & Research Libraries News ,60(5), pp. 371–375. ANDERSON ,R .E&O BENSHAIN ,S.S.(1994) Cheating by students: ﬁndings, reﬂections and remedies, Academic Medicine ,69, pp. 323–332. ANONYMOUS (1995) Deﬁning plagiarism, Science Communication ,16(4), pp. 459–461. ANONYMOUS (1997) What’s wrong with copying?, Economist ,5April, 343 (8011), pp. 77–78. ANONYMOUS (2001) Bringing colleges up to code, Newsweek ,16July, 138 (3), p. 8. ANONYMOUS (2002) Plagiarise. Let no one else’s work evade your eyes, Economist ,362 (8264), p. 81. ASHWORTH ,P., B ANNISTER ,P .&T HORNE ,P.(1997) Guilty in whose eyes? University students’ perceptions of cheating and plagiarism in academic work and assessment, Studies in Higher Edu- cation ,22(2), pp. 187–203. AUER,N .J .&K RUPAR ,E.M.(2001) Mouse click plagiarism: the role of technology in plagiarism and the librarian’s role in combating it, Library Trends ,49(3), pp. 415–433. BALDWIN ,D . C., D AUGHERTY ,S .R .&R OWLEY ,B.D.(1998) Unethical and unprofessional conduct observed by residents during their ﬁrst year of training, Academic Medicine ,73, pp. 1195–1200. BARNETT ,D .C .&D ALTON ,J.C.(1981) Why college students cheat, Journal of College Student Personnel ,22, pp. 545–551. BARNHART ,R.K.(Ed.) (1988) Chambers Dictionary of Etymology (Edinburgh, Chambers). BATY,P.(2000) Copycats roam in an era of the new, Times Higher Education Supplement ,14July, p. 4. BATY,P.(2001) Cambridge postgrad ﬁghts to clear his name, Times Higher Education Supplement ,9 February, p. 8. BATY,P.(2002) Plagiarism puts Monash VC out of job, Times Higher Education Supplement ,19July, p. 1. BINK,M . L., M ARSH ,R .L., H ICKS,J .L .&H OWARD ,J.D.(1999) The credibility of a source inﬂuences the rate of unconscious plagiarism., Memory ,7,pp. 293–309. BOWDEN ,D.(1996) Coming to terms, English Journal ,85(4), pp. 82–85. BOWERS ,N.(1994) A loss for words, American Scholar ,63, pp. 545–556. BRANDT ,D.S.(2002) Copyright’s (not so) little cousin, plagiarism, Computers in Libraries ,22(5), pp. 39–42. BROAD ,W.J.(1997) Findings back Einstein in a plagiarism dispute, New York Times ,18November, p. F2. BROWN ,A .S .&H ALLIDAY ,H.E.(1991) Cryptomnesia and source memory difﬁculties, American Journal of Psychology ,104, pp. 475–491.Plagiarism Literature and Lessons 485 BROWN ,B.S.(1995) The academic ethics of graduate business students: a survey, Journal of Education for Business ,70(3), pp. 151–156. BROWN ,V .J .&H OWELL ,M.E.(2001) The efﬁcacy of policy statements on plagiarism: do they change students’ views? Research in Higher Education ,42(1), pp. 103–118. BUCKLEY ,M . R., W IESE,D .S .&H ARVEY ,M.G.(1998) An investigation into the dimensions of unethical behaviour, Journal of Education for Business ,73(5), pp. 284–290. BUGEJA ,M.J.(2001) Collegiate copycats, Editor & Publisher ,134 (46), p. 22. BURNETT ,S.(2002) Dishonor and distrust, Community College Week ,7August, 14 (24), pp. 6–8. CALABRESE ,R .L .&C OCHRAN ,J.T.(1990) The relationship of alienation to cheating among a sample of American adolescents, Journal of Research and Development in Education ,23(2), pp. 65–72. CARMACK ,B.J.(1983) Resolving an incident of academic dishonesty: plagiarism, Nurse Educator ,8(1), pp. 9–12. CARNIE ,A.(2001) How to handle cyber-sloth in academe, Chronicle of Higher Education ,5January, 47 (17), p. B14. CARSON ,C .&H OLLORAN ,P.(1991) Martin Luther King, Jr, as scholar: a re-examination of his theological writings, Journal of American History ,78(1), pp. 92–105. CARUANA ,A., R AMASESHAN ,B .&E WING ,M.T.(2000) The effect of anomie on academic dishonesty among university students, International Journal of Educational Management ,14(1), pp. 23–30. COHEN ,M.(2001) Was Wittgenstein a plagiarist? Philosophy ,76, pp. 451–460. COLE,S .&C ONKLIN ,D.L.(1996) Academic integrity policies and procedures: opportunities to teach students about moral leadership and personal ethics, College Student Affairs Journal ,15(2), pp. 30–39. COLE,S .&M CCABE,D.L.(1996) Issues in academic integrity, New Directions for Student Services ,73, pp. 67–77. COLON ,A.(2001) Avoid the pitfalls of plagiarism, Writer ,114 (1), p. 8. DANIEL ,L .G . et al.(1991) Academic misconduct among teacher education students: a descriptive—cor- relational study, Research in Higher Education ,32(6), pp. 703–724. DANIEL ,L .G . et al .(1994) Academic misconduct among nursing students: a multivariate investigation, Journal of Professional Nursing ,10(5), pp. 278–288. DAVIS,S .F .&L UDVIGSON ,H.W.(1995) Additional data on academic dishonesty and a proposal for remediation, Teaching of Psychology ,22(2), pp. 119–121. DAVIS,S .F . et al .(1992) Academic dishonesty: prevalence, determinants, techniques and punishments, Teaching of Psychology ,19(1), pp. 16–20. DEKERT ,G.D.(1993) Perspectives on plagiarism from ESL students in Hong Kong, Journal of Second Language Writing ,2(2), pp. 131–148. DEZZANI ,M.(1999) Michael Jackson found guilty in Italy of plagiarising song, Billboard ,29May, 111 (22), p. 46. DIEKHOFF ,G .M . et al .(1996) College cheating: ten years later, Research in Higher Education ,37(4), pp. 487–502. DIEKHOFF ,G .M., L ABEFF,E .E., S HINOHARA ,K .&Y ASUKAWA ,H.(1999) College cheating in Japan and the United States, Research in Higher Education ,40(3), pp. 343–353. EVANS ,E .D .&C RAIG ,D.(1990) Teacher and student perceptions of academic cheating in middle and senior high schools, Journal of Educational Research ,84(1), pp. 44–52. EVANS ,F .B .&Y OUMANS ,M.(2000) ESL writers discuss plagiarism: the social construction of ideologies, Journal of Education ,182 (3), pp. 49–66. FERRELL ,C .M .&D ANIEL ,L.G.(1995) A frame of reference for understanding behaviors related to the academic misconduct of undergraduate teacher education students, Research in Higher Education ,3 6 (3), pp. 345–375. FIALKOFF ,F.(1993) There’s no excuse for plagiarism, Library Journal ,118 (17), p. 56. FIALKOFF ,F.(2002) Rampant plagiarism, Library Journal ,127 (4), p. 70. FITZGERALD ,M.(2002) A plague of plagiarism, Writer ,115 (7), pp. 16–19. FRANKE ,A.H.(1993) Plagiarism, Academe ,79(5), p. 64. FREEDMAN ,M.(1994) The persistence of plagiarism, the riddle of originality, Virginia Quarterly Review , 70 (3), pp. 504–518. FUREDI ,F.(2000) Online cat and mouse, Times Higher Education Supplement ,14July, p. 16. GERDEMAN ,R.D.(2000) Academic dishonesty and the community college, ERIC Digest ,ED447840. GOLDGAR ,B.A.(2001) Imitation and plagiarism: the Lauder Affair and its critical aftermath, Studies in Literary Imagination ,34(1), pp. 1–17.486 C. Park GOLDSTEIN ,L.(1999) Wittgenstein’s PhD Viva—a re-creation, Philosophy ,74, pp. 499–514. GOTTLIEB ,A.(1994) Did Sartre ever exist?, New York Times Book Review ,23January, pp. 12–14. GRAY,P.(2002) Other people’s words, Smithsonian ,32(12), pp. 102–104. GROARK ,M., O BLINGER ,D .&C HOA,M.(2001) Term paper mills, anti-plagiarism tools, and academic integrity, Educause Review ,36(5), pp. 40–48. GROOM ,N.(2000) The ﬁne art of making it by faking it, Times Higher Education Supplement ,7January, pp. 18–19. HAINES ,V .J . et al .(1986) College cheating: immaturity, lack of commitment, and the neutralising attitude, Research in Higher Education ,25(4), pp. 342–354. HANKS ,P.(Ed.) (1979) Collins Dictionary of the English Language (Glasgow, William Collins). HARDY ,R.J.(1981/2) Preventing academic dishonesty: some important tips for political science professors, Teaching Political Science ,9(2), pp. 68–77. HIGBEE ,J .L .&T HOMAS ,P.V.(2000) Preventing academic dishonesty, Research and Teaching in Developmental Education ,17(1), pp. 63–66. HOLLINGER ,R .C .&L ANZA -KADUCE ,L.(1996) Academic dishonesty and the perceived effectiveness of countermeasures: an empirical survey of cheating at a major public university, NASPA Journal ,33(4), pp. 292–306. HOPKIN ,K.(1993) Scientiﬁc plagiarism and the theft of ideas, Science ,261, p. 631. HOWARD ,R.M.(2000) Sexuality, textuality: the cultural work of plagiarism, College English ,62, pp. 473–492. HOWARD ,R.M.(2002) Don’t police plagiarism: just teach!, Education Digest ,67(5), pp. 46–50. IOVACCHINI ,E .V . et al .(1989) A comparative study of academic integrity at three different types of universities, College Student Affairs Journal ,9(1), pp. 35–43. JENDREK ,M.P.(1992) Students’ reactions to academic dishonesty, Journal of College Student Develop- ment ,33, pp. 260–273. JULIUS ,A.(1998) William Shakespeare, you stand accused of being a crow, and ape and a thief. How do you plead? New Statesman ,15May, 127 (4385), pp. 40–43. KARLINS ,M . et al.(1988) An empirical investigation of actual cheating in a large sample of undergrad- uates, Research in Higher Education ,29(4), pp. 359–364. KELLOGG ,A.P.(2002) Students plagiarise online less than many think, a new study ﬁnds, Chronicle of Higher Education ,15February, 48 (23), p. A44. KESSLER ,S.(1998) Steven Spielberg wins plagiarism case, New York Times ,29January, p. A20. KIBLER ,W.L.(1994) Addressing academic dishonesty: what are institutions of higher education doing and not doing?, NASPA Journal ,31(2), pp. 92–101. KRUSE ,H.H.(1990) Mark Twain’s A Connecticut Yankee: reconsiderations and revisions, American Literature ,62(3), pp. 464–484. LAIRD ,E.(2001) We all pay for Internet plagiarism, Education Digest ,67(3), pp. 56–60. LANDAU ,J .D., D RUEN ,P .B .&A RCURI ,J.A.(2002) Methods for helping students avoid plagiarism, Teaching of Psychology ,29(2), pp. 112–115. LATHROP ,A .&F OSS,K.(2000) Student Cheating and Plagiarism in the Internet Era: a wake-up call (Englewood, CO, Libraries Unlimited). LEATHERMAN ,C.(1999) At Texas A&M, conﬂicting charges of misconduct tear a program apart, Chronicle of Higher Education ,5November, 46 (11), pp. A18–A21. LEBLANC ,L.(1997) Celine Dion song at centre of Canadian plagiarism suit, Billboard ,13September, 109 (37), p. 14. LEMING ,J.S.(1980) Cheating behaviour, subject variables and components of the internal–external scale under high and low risk conditions, Journal of Educational Research ,74(2), pp. 83–87. LIEBERMAN ,T.(1995) Plagiarise, plagiarise, plagiarise … only be sure to always call it research, Columbia Journalism Review ,34(2), pp. 21–26. LIM,V .K .G .&S EE,S.K.B.(2001) Attitudes towards, and intentions to report, academic cheating among students in Singapore, Ethics and Behaviour ,11(3), pp. 261–275. LOVE,P.,G. & S IMMONS ,J.(1998) Factors inﬂuencing cheating and plagiarism among graduate students in a college of education, College Student Journal ,32, pp. 539–551. LUKER ,R.(1993) Plagiarism and perspective, International Social Science Review ,68(4), pp. 152–161. LUPTON ,R.,A., C HAPMAN ,K.,J. & W EISS,J.,E. (2000) A cross-national exploration of business students’ attitudes, perceptions and tendencies toward academic dishonesty, Journal of Education for Business , 75 (4), pp. 231–235. MACILWAIN ,C.(1998) Congressman launches plagiarism inquiry, Nature ,392, p. 113.Plagiarism Literature and Lessons 487 MACRAE ,C.,N., B ODENHAUSEN ,G.,V. & C ALVINI ,G.(1999) Contexts of cryptomnesia: may the force be with you, Social Cognition ,17, pp. 273–297. MADDOX ,J.(1995) Plagiarism is worse than mere theft, Nature ,376, p. 721. MALLON ,T.(1989) Stolen Words: forays into the origins and ravages of plagiarism (London, Ticknor &Fields). MARSH ,R .L .&L ANDAU ,J.D.(1995) Item availability in cryptomnesia: assessing its role in two paradigms of unconscious plagiarism, Journal of Experimental Psychology ,21, pp. 1568–1583. MARSH ,R .L .&L ANDAU ,J.D.(1997) Contributions of inadequate source monitoring to unconscious plagiarism during idea generation, Journal of Experimental Psychology ,23(4), pp. 886–898. MAY,K .M .&L LOYD ,B.H.(1993) Academic dishonesty: the honor system and students’ attitudes, Journal of College Student Development ,34(2), pp. 125–129. MCCABE,D.L.(2001) Cheating: why students do it and how we can help them stop, American Educator , 25 (4), pp. 38–43. MCCABE,D .L .&B OWERS ,W.J.(1994) Academic dishonesty among males in college: a thirty year perspective, Journal of College Student Development ,35(1), pp. 5–10. MCCABE,D .L .&B OWERS ,W.J.(1996) The relationship between student cheating and college fraternity or sorority membership, NASPA Journal ,3(4), pp. 280–291. MCCABE,D .L .&P AVELA ,G.(1997) The principled pursuit of academic integrity, AAHE Bulletin , December, pp. 11–12. MCCABE,D .L .&T REVINO ,L.K.(1993) Academic dishonesty: honor codes and other contextual inﬂuences. Journal of Higher Education 64 (5), pp. 522–538. MCCABE,D .L .&T REVINO ,L.K.(1997) Individual and contextual inﬂuences on academic dishonesty: amulti-campus investigation, Research in Higher Education ,38, pp. 379–396. MCCABE,D .L .&T REVINO ,L.K.(2002) Honesty and honor codes, Academe ,88(1), pp. 37–42. MCCABE,D . L., T REVINO ,L .K .&B UTTERFIELD ,K.D.(1999) Academic integrity in honor code and non-honor code environments: a qualitative investigation, Journal of Higher Education ,70(2), pp. 211–234. MCMULLEN ,B.S.(1995) Lifting the lid on Poe’s ‘Oblong Box’, Studies in American Fiction ,23(2), pp. 203–215. MEADE ,J.(1992) Cheating: is academic dishonesty par for the course?, Prism ,1(7), pp. 30–32. MICHAELS ,J .W .&M IETHE ,T.D.(1989) Applying theories of deviance to academic cheating, Social Science Quarterly ,70, pp. 870–885. MILLER ,K.D.(1993) Redeﬁning plagiarism: Martin Luther King’s use of an oral tradition, Chronicle of Higher Education ,20January, 39 (20), p. A60. MILLS,C.(1994) Acknowledging sources in written assignments, Journal of Geography in Higher Education ,18(2), pp. 263–269. MORGAN ,B .&T HOMSON ,A.(1997) Keele to probe standard of PhDs, Times Higher Education Supplement ,7November, p. 1. NUSS,E.M.(1984) Academic integrity: comparing faculty and student attitudes, Improving College and University Teaching ,32(3), pp. 140–144. OVERBEY ,G .A .U .&G UILING ,S.F.(1999) Student perceptions of plagiarism and the evaluation of assignments, Journal of Excellence in College Teaching ,10(3), pp. 3–22. PALDY ,L.G.(1996) The problem that won’t go away: addressing the causes of cheating, Journal of College Science Teaching ,26(1), pp. 4–6. PAYNE ,S .L .&N ANTZ ,K.S.(1994) Social accounts and metaphors about cheating, College Teaching , 42 (3), pp. 90–96. PENPENNY ,P .L .&K ERIAZOKAS ,M.S.(1998) In search of inadvertent plagiarism, American Journal of Psychology ,111, pp. 529–560. PERIN,N.(1992) How I became a plagiarist, American Scholar ,61(2), pp. 257–260. PULVERS ,K .&D EIKHOFF ,G.M.(1999) The relationship between academic dishonesty and college classroom environment, Research in Higher Education ,40, pp. 487–498. RAFFETTO ,W.G.(1985) The cheat, Community and Junior College Journal ,56(2), pp. 26–27. REAMS ,B.D.(1987) Revocation of academic degrees by colleges and universities, Journal of College and University Law ,14(2), pp. 283–302. ROBERTS ,D .&R ABINOWITZ ,W.(1992) An investigation of student perceptions of cheating in academic situations, Review of Higher Education ,15(2), pp. 179–190. ROBERTS ,R.N.(1986) Public university responses to academic dishonesty: disciplinary or academic, Journal of Law and Education ,15(4), pp. 369–384.488 C. Park ROIG,M.(2001) Plagiarism and paraphrasing criteria of college and university professors, Ethics and Behaviour ,11, pp. 307–324. ROSE,J.(1992) The invisible sources of Nineteen Eighty-Four, Journal of Popular Culture ,26(1), pp. 93–108. ROTH,N .L .&M CCABE,D.L.(1995) Communication strategies for addressing academic dishonesty, Journal of College Student Development ,36, pp. 531–541. SAUNDERS ,E.J.(1993) Confronting academic dishonesty, Journal of Social Work Education ,29(2), pp. 224–230. SEPPANEN ,R.(2002) Finns target master plagiarists, Times Higher Education Supplement ,1February, p. 11. SILVERMAN ,G.(2002) It’s a bird, it’s a plane, it’s Plagiarism Buster!, Newsweek ,15July, p. 12. SIMS,R.L.(1993) The relationship between academic dishonesty and unethical business practices, Journal of Education for Business ,68(4), pp. 207–211. SIMS,R.L.(1995) The severity of academic dishonesty: a comparison of faculty and student views, Psychology in the Schools ,32(3), pp. 233–238. SINGHAL ,A .C .&J OHNSON ,P.(1983) How to halt student dishonesty, College Student Journal ,17(1), pp. 13–19. SMITH ,C.U.M.(1998) Descartes’ visit to the Town Library, or how Augustinian is Descartes’ Neurophysiology? Journal of the History of the Neurosciences ,7(2), pp. 93–101. SMITH ,I.(1995) Tribunal to reassess plagiarism allegations, Times Higher Education Supplement ,2 4 February, p. 5. STAHL ,S.(2002) Ethics and the no-fear generation, Information Weekly ,18March, 880, p. 8. STEBELMAN ,S.(1998) Cybercheating: dishonesty goes digital, American Libraries ,29(8), pp. 48–51. STERN ,E .B .&H AVLICEK ,L.(1986) Academic misconduct: results of faculty and undergraduate surveys, Journal of Allied Health ,15(2), pp. 129–142. STEVENS ,G .E .&S TEVENS ,F.W.(1987) Ethical inclinations of tomorrow’s managers revisited, Journal of Education for Business ,63(1), pp. 24–29. STONE ,R.(1996) Alabama challenges fraud award, Science ,272, p. 473. STRAW ,D.(2002) The plagiarism of generation ‘why not?’, Community College Week ,8July, 14 (24), pp. 4–7. SUTTON ,E.,M. & H UBA,M.E.(1995) Undergraduate student perceptions of academic dishonesty as a function of ethnicity and religious participation, NASPA Journal ,33(1), pp. 19–34. TAYLOR ,H.(1995) ‘The griot from Tennessee’: the saga of Alex Haley’s Roots, Critical Quarterly ,3 7 (2), pp. 46–63. THOMAS ,M.W.(2000) Eschewing credit: Heywood, Shakespeare and plagiarism before copyright, New Literary History ,31(2), pp. 277–294. VANDERVOORT ,F.(1995) Can scientiﬁc integrity be taught? Science Teacher ,62(4), pp. 38–42. WEEKS ,S.(2001) Plagiarism: think before pointing ﬁnger of blame, Times Higher Education Sup- plement ,15May, p. 24. WHITE,E.M.(1993) Too many campuses want to sweep student plagiarism under the rug, Chronicle of Higher Education ,24February, 39 (25), p. A44. WHITEMAN ,S .A .&G ORDON ,J.L.(2001) The price of an A: an educator’s responsibility to academic honesty, English Journal ,91(2), pp. 25–31. WHITENECK ,P.(2002) What to do with a thought thief, Community College Week ,8July, 14 (24), pp. 4–7. WILHOIT ,S.(1994) Helping students avoid plagiarism, College Teaching ,42(4), pp. 161–165. WILSON ,R.(1999) Colleges urged to better deﬁne academic integrity and to stress its importance, Chronicle of Higher Education ,15October, 46 (8), p. A18. WOJTAS ,O.(1999) Accused students claim they ‘cooperated’ not collaborated, Times Higher Education Supplement ,27August, p. 36. YOUNG ,J.R.(2001) The cat-and-mouse game of plagiarism detection, Chronicle of Higher Education , 6July, 47 (43), pp. A26–A28. ZANGRANDO ,R.L.(1991/2) Historians’ procedures for handling plagiarism, Publishing Research Quarterly ,7(4), pp. 57–64. ZEITCHIK ,S.M.(1998) Chase-Riboud drops Amistad copyright suit, Publishers Weekly ,16February, p. 105."
            }
        ]
    }
}