{
    "data": [
        {
            "title": "Sample",
            "content": "Sample data"
        },
        {
            "title": "Sample",
            "content": "---- 1 ----\n\n Stress Management\nHSC 1171 - 12\nCourse Overview\nCourse Title: Stress Management\nCourse Modality: Online (Asynchronous)\nOnline\nInstructor Information\nName: Dr. Jay Brown\nEmail: Jay.Brown@tcc.fl.edu\nPhone: 850 201-8352\nOffice Location: Zoom ID: 738 645 2616\nOffice Hours: Mondays 1-2 PM\nCourse Description\nCourse Description: \nExplores the nature and scope of stress in today's society, with emphasis on the impact\nof stress on human health. Coping strategies for environmental, social and internally\ninduced stressors are discussed.\nCredits: 3.00\n\n---- 2 ----\n\nPrerequisites and Corequisites: \nContact Hours: 3.00\nTextbooks\nTitle: Comprehensive Stress Management\nISBN: 9781260834628\nAuthors: Jerrold S. Greenberg\nPublication Date: 2021-01-01\nCourse Outcomes\nPlease include the student learning outcomes for the course.\n1. Define stress and recognize the effects of stress on all the\ndimensions of health. 2. Identify their perceived stressors and\npotential stressors. 3. Discuss stress effects on the psychological and\nphysiological functioning of the human body. 4. Recognize the\npsychological and physiological symptoms of stress. 5. Relate stress\nas a causative or contributing factor to the more common infectious\nand chronic diseases and debilitating conditions. 6. Analyze the role\nof perception and choice making in the creation of stress. 7.\nRecognize and evaluate the individual's role in the management of\ntheir own stress. 8. Identify changes in life situations and recognize\nhow these changes affect our stress levels. 9. Evaluate strategies for\nmanaging the stress of change. 10. Analyze methods of changing\npersonal lifestyle behaviors. 11. Discuss beneficial and detrimental\neffects in various stress management styles. 12. Practice personal\nmanagement skills. 13. Explore and evaluate relationship skills,\nincluding communications and conflict resolution, as potential coping\n\n---- 3 ----\n\nstrategies. 14. Identify their personal support systems. 15. Recognize\nthe need for assertive behavior and explain its relationship to stress\nlevels. 16. Compare and contrast personal responses to stressful\nsituations. 17. Discuss and relate personality characteristics\nassociated with cardiovascular disease, depression, and cancer. 18.\nAnalyze their personal locus of control and relate it to personality\ntypes and stress control. Tallahassee Community College 3 19.\nEvaluate the individual’s concept of self-esteem and its relationship to\nstress management. 20. Recognize the role of positive thinking in\nstress management. 21. Practice viewing potentially stressful\nsituations in different perspectives. 22. Identify foods and/or eating\npatterns that help to prevent physiological stress or to replenish\nnutrients lost during periods of intense stress. 23. Identify foods\nand/or eating patterns that may induce physiological stress. 24.\nEvaluate how different components of physical fitness play a role in\npreventing physiological stress. 25. Evaluate how different\ncomponents of physical fitness can play a role in decreasing\nphysiological stress. 26. Recognize the role of sleep in stress\nmanagement. 27. Discuss the application of coping strategies for\nvarious life situations, current and future. 28. Identify and/or\nexperience various forms of relaxation.\nGeneral Education Learning Outcomes\nIf applicable to the course, please include the general education learning\noutcomes for the course.\n1. Acquaint students with the nature and scope of stress in today's\nsociety and the effect on their personal wellness. 2. Provide the\nopportunity to explore alternative coping skills to better deal with\nstressful events and to improve the quality of life. 3. Satisfy 3\nsemester hours of elective credit.\n\n---- 4 ----\n\nCourse Expectations\nExams: There will be four unit exams each with a value of 100 points. They\nwill be completed online. You will have one (1) week in order to complete\neach exam. You do not have to go to the testing center to complete exams.\nThese tests will not be cumulative in nature. Makeup exams will not be\npermitted unless under extreme circumstances and are at the discretion of\nthe instructor. A review will be given prior to the exam date.\nFinal Exam: The final exam will essentially be your fourth unit exam. All\nstudents must take the final exam by the designated time (see class\nschedule). The final exam also has a value of 100 points.\nHomework Assignments: There will be ten (10) homework assignments\ngiven throughout the semester. Assignments will include all instructions, due\ndates and tips on how to do a good job. These assignments must be\ncompleted on the date specified in order to receive full credit for the\nassignment. You will have one (1) week to complete each homework\nassignment. Unless stated otherwise, all writing and homework assignments\nmust be turned into Canvas by 11:59pm of the date specified in order to\nreceive credit. Submissions after the deadline and any requests for\nextensions will be ignored unless extreme emergencies arise. Assignments\nshould be completed early in the event that technological issues arise and\nfurther assistance is needed.\nLearnSmart Assignments: You must first register for the course by clicking\non “McGraw Hill Connect” in the “Getting Started” module. Please see the\nPowerPoint “Accessing Connect” for step-by-step details on how to do this.\nThere will be 16 Learn Smart assignments due throughout the semester for\na total of 320 points. Without completing any of these assignments, the\nhighest grade that you can get in the class is a D. You will have three (3)\nweeks to complete most LearnSmart assignments and unlimited attempts\nso the only way not to get full credit is to not complete them. It is imperative\n\n---- 5 ----\n\nthat you become familiar with LearnSmart via Connect within the first week\nof class. Any questions regarding usage should be directed to the McGraw-\nHill technological assistance line at 1-800-331-5094. Please ensure that you\nunderstand how to complete the assignments early in the semester. No\nexcuses will be accepted regarding lack of access or comprehension of the\nwebsite, as there are several labs available for your usage and an app\navailable for both Apple and Android users (LearnSmart is the name of the\napp as well).\nReadiness Quiz: This quiz is mandatory for you to continue in this course. It\nmust be completed after you have reviewed the Syllabus and Schedule, my\nwelcome, tip for success, and registered your access code via Connect in\nthe module on Canvas. This quiz must be taken by Monday, March 27th at\n11:59pm for attendance verification purposes.\nCourse Outline\nUnit 1\nWhat is Stress?\nStress Psychophysiology\nStress and Illness/Disease\nStress and the College Student\nUnit 2\nStress Interventions\nIntrapersonal Interventions\nInterpersonal Interventions\nPerception Interventions\nUnit 3\n\n---- 6 ----\n\nSpirituality and Stress\nMeditation\nAutogenic Training, Imagery, & Progressive Relaxation\nOther Relaxation Techniques\nUnit 4\nPhysiological Arousal Interventions\nStress Strategies\nDiversity & Stress\nOccupational Stress\nFamily Stress\nCourse Grade Evaluation\nGrading: The final grade is based upon a total of 1000 points:\nExams 400 points (4 at 100 points each)\nSmartBook (LearnSmart)\nAssignments320 points (16 at 20 points each)\nHomework Assignments 200 points (10 at 20 points)\nStress Management Plan 50 points\nDigital Literacy 15 points\nReadiness Quiz 15 points\nTotal 1000 points\nGrade Scale\nGrading Scale:\n900 to 1000 = A\n800 to 899 = B\n\n---- 7 ----\n\n700 to 799 = C\n600 to 699 = D\n< 599 = F\nTips for Student Success\nMake academics your priority.\nPay attention to due dates.\nUse an organizational tool.\nComplete assignments early.\nUse campus resources.\nAsk for help when you need it.\nCheck email often.\nTCC Equity Statement\nTallahassee Community College is committed to improving equity by deliberately\nensuring justice and fairness within the procedures and processes of the college, as well\nas in its distribution of resources. Equity is the practice that begins by acknowledging that\nadvantages and barriers exist and that personal or social circumstances, such as\nprotected class or intersecting identities, are not obstacles to achieving one’s goals.\nTCC’s Equal Access/Equal Opportunity Statement\nTallahassee Community College does not discriminate against any person on the basis\nof age, color, disability, ethnicity, gender identity, genetic information, marital status,\nnational origin, pregnancy, race, religion, sex, sexual orientation, veteran status, or other\nprotected class in its programs and activities. Inquiries regarding the non-discrimination\npolicies may be directed to: Renae Tolson, Equity Officer | Room 239 Administration\n\n---- 8 ----\n\nBuilding | 444 Appleyard Drive | Tallahassee, FL 32304-2895 | (850) 201-6074\n| renae.tolson@tcc.fl.edu\nAmericans with Disabilities Act\nTallahassee Community College is committed to making all programs, services, and\nfacilities accessible to and usable by persons with disabilities for students to obtain\nmaximum benefit from the educational experience and to effectively transition to our\ncollege environment. Students with disabilities who identify themselves and provide\nappropriate documentation are eligible for support services. To access these services,\nplease contact the TCC Student Accessibility Services (SAS) Office.\nSAS Office Location\nFirst floor of Technology & Professional Programs within the Accessibility & Resource\nCenter (ARC), Room 141\nOffice Hours: Monday-Friday, 8:00 a.m.- 5:00 p.m.\nPhone (Voice): (850) 201-8430\nFax: (850) 201-8433\nE-mail: SAS@tcc.fl.edu\nFlorida Relay Service: 711\nVideo Relay Service: (850) 270-6236 or (850) 270-6231\nAcademic Resources (Help Outside of Class)\n1. The TCC Learning Commons: www.tcc.fl.edu/learningcommons, 850-201-8193\nprovides one-stop convenient access to expanded learning assistance and\nresources. The TCC Learning Commons is an excellent place to do your online\nhomework and to get help, including one on one conferences! You can view the\nTCC Learning Commons website to view their hours of operation and other\nservices.\n2. Q Less Tutoring: https://tcc.mediaspace.kaltura.com\n3. Virtual Learning Common’s SmartThinking Online Tutoring: See TCC Learning\nCommons website and navigate to these resources available 24/7. Info also\n\n---- 9 ----\n\navailable by clicking here.\n4. TCC’s Library: https://www.tcc.fl.edu/academics/academic-divisions/library/, 850-\n201-8376.\n5. The TCC Library: https://www.tcc.fl.edu/academics/academic-divisions/library/,\n850-201-8376 provides resources and services to help you achieve academic\nsuccess. Librarians are available to assist you with research assignments and\ncitations at the second-floor reference desk, the Ghazvini Library, or by virtual or in-\nperson appointment via the appointment scheduler on the library website. Check\nout books in the regular collection, course reserve textbooks, laptops, and more at\nthe first-floor circulation desk. All library employees can assist you with basic\nservices, including printing, computer use, and booking a study room. \n6. Email a TCC librarian: https://askalibrarian.org/email.php?id=1695 \n7. Schedule an appointment with a TCC librarian: https://tcc-\nfl.libcal.com/appointments.\nClass Recordings\nAt Tallahassee Community College, students may, without prior notice, audio or video\nrecord a class lecture (does not include lab or recitation sessions) in which the student is\nenrolled for three specified purposes as outlined in House Bill 233 Section 1004.097,\nFlorida Statutes: (1) for the student’s own personal educational use; (2) in connection\nwith a complaint to the college where the recording is made; or (3) as evidence in, or in\npreparation for, a criminal or civil\nproceeding. https://www.tcc.fl.edu/about/college/provost/class-recordings/\nStudent Expectations\nYou can contact the instructor directly via Canvas or via TCC email. Use\nTCC email accounts ONLY. Check your TCC email account at least daily for\nimportant information regarding the course. Email from other providers will\nbe deleted due to virus concerns. Include course name, section (web\nsection) in subject line, salutation, and sign your emails with your full name.\nYou can expect a response from the instructor within 48 hours through any\n\n---- 10 ----\n\nof the aforementioned methods of communication. Please do not send\nmultiple correspondences. You will be contacted as promptly as time allows."
        }
    ]
}